In [2]:
import pymysql
import pandas as pd

어떤 데이터 베이스에 접속할 것인지 클래스를 생성

In [3]:
_db = pymysql.connect(
    user = "root",
    password = "pw0426!",
    host = "localhost",
    db = "ubion",
    charset = "utf8"
)
#뭔가 클래스를 생성

In [4]:
#생성된 클래스 모듈 호출, 커서 만들기 
cursor = _db.cursor(pymysql.cursors.DictCursor)
#pymysql.cursors.Cursor 가 아닌 pymysql.cursors.DictCursor로 받아와야 딕셔너리 형태로서 pd로 만들기 편하다.

In [5]:
sql_db = "SELECT * FROM user_info"

cursor.execute(sql_db)
result = cursor.fetchall( )
print(result)
dt = pd.DataFrame(result) #딕셔너리 형태의 데이터 값이기 때문에 pd는 key를 자동적으로 컬럼으로 올려준다. 
dt

[{'ID': 'test', 'password': '1234', 'name': '고길동', 'phone': '01099239393', 'ads': '서울시 강북구 쌍문동', 'gender': 1, 'age': 45, 'regit_date': '20220310'}, {'ID': 'test2', 'password': '5678', 'name': '둘리', 'phone': '01098775733', 'ads': '북극 빙하 아래', 'gender': 1, 'age': 10, 'regit_date': '20220310'}, {'ID': 'test3', 'password': '9443', 'name': '마이콜', 'phone': '01023849343', 'ads': '고길동 옆 집', 'gender': 1, 'age': 28, 'regit_date': '20220310'}, {'ID': 'test4', 'password': '4321', 'name': '또치', 'phone': '01012345678', 'ads': '동물원', 'gender': 2, 'age': 4, 'regit_date': '20220310'}, {'ID': 'test5', 'password': '1234', 'name': '행인1', 'phone': '01023455665', 'ads': '서울특별시 어딘가', 'gender': 2, 'age': 20, 'regit_date': '20220310'}, {'ID': 'test8', 'password': '2345', 'name': '희동이', 'phone': '01099999999', 'ads': '', 'gender': 1, 'age': 5, 'regit_date': '2022.03.11'}]

      ID password name        phone          ads  gender  age  regit_date
0   test     1234  고길동  01099239393  서울시 강북구 쌍문동       1   45    20220310
1  test2     5678   둘리  01098775733     북극 빙하 아래       1   10    20220310
2  test3     9443  마이콜  01023849343      고길동 옆 집       1   28    20220310
3  test4     4321   또치  01012345678          동물원       2    4    20220310
4  test5     1234  행인1  01023455665    서울특별시 어딘가       2   20    20220310
5  test8     2345  희동이  01099999999                    1    5  2022.03.11

In [6]:
dt = pd.DataFrame(result) #딕셔너리 형태의 데이터 값이기 때문에 pd는 key를 자동적으로 컬럼으로 올려준다. 
dt

      ID password name        phone          ads  gender  age  regit_date
0   test     1234  고길동  01099239393  서울시 강북구 쌍문동       1   45    20220310
1  test2     5678   둘리  01098775733     북극 빙하 아래       1   10    20220310
2  test3     9443  마이콜  01023849343      고길동 옆 집       1   28    20220310
3  test4     4321   또치  01012345678          동물원       2    4    20220310
4  test5     1234  행인1  01023455665    서울특별시 어딘가       2   20    20220310
5  test8     2345  희동이  01099999999                    1    5  2022.03.11

In [6]:
dt

      ID password name        phone          ads  gender  age regit_date
0   test     1234  고길동  01099239393  서울시 강북구 쌍문동       1   45   20220310
1  test2     5678   둘리  01098775733     북극 빙하 아래       1   10   20220310
2  test3     9443  마이콜  01023849343      고길동 옆 집       1   28   20220310
3  test4     4321   또치   0102939432          동물원       2    4   20220310
4  test5     1234  행인1  01023455665    서울특별시 어딘가       2   20   20220310

In [11]:
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s )" 
values = ["tes6", "4321", "또치", "0102939432", "동물원", 2, 4, "20220310"]

cursor.execute(sql,values)
_db.commit()

In [14]:
dt

      ID password name        phone          ads  gender  age regit_date
0   test     1234  고길동  01099239393  서울시 강북구 쌍문동       1   45   20220310
1  test2     5678   둘리  01098775733     북극 빙하 아래       1   10   20220310
2  test3     9443  마이콜  01023849343      고길동 옆 집       1   28   20220310
3  test4     4321   또치   0102939432          동물원       2    4   20220310
4  test5     1234  행인1  01023455665    서울특별시 어딘가       2   20   20220310

In [ ]:
#input_ID = input("ID 값: ")
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s )"

_ID = input("ID: ")
pw = input("password: ")
name = input("name: ")
phone = input("phone : ")
ads = input("ads: ")
gender = input("gender : ")
age = input("age : ")
regit_date = input("regit_date : ")

input_list = [_ID,pw,name,phone,ads,gender,age, regit_date]

cursor.execute(sql,input_list)
_db.commit()

In [15]:
x = input("x: ")
type(x)

str

In [27]:
del_sql = """ DELETE FROM user_info WHERE ID = "tes6" """
cursor.execute(del_sql)
_db.commit()

In [8]:
update_sql = ''' SELECT ID,
                 password,
                 name,
                 ads,
                 age,
                 FROM user_info '''

print(update_sql)

 SELECT ID,
                 password,
                 name,
                 ads,
                 age,
                 FROM user_info

또치의 핸드폰 번호를 바꿔주자

In [19]:
update_sql = """UPDATE user_info 
                SET phone = "01012345678" 
                WHERE name = "또치" """


cursor.execute(update_sql)
#추가로 입력할 값은 없으니 다른거 안하고 
_db.commit()

In [1]:

def sql():
    sql_db = "SELECT * FROM user_info"
    cursor.execute(sql_db)
    result = cursor.fetchall( )
    dt = pd.DataFrame(result) #딕셔너리 형태의 데이터 값이기 때문에 pd는 key를 자동적으로 컬럼으로 올려준다. 
    
    return dt
sql()

NameError: name 'cursor' is not defined